#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Reading...
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.user_assigned_managed_identity.random_uuid.telemetry[0]: Refreshing state... [id=6a346a94-586a-8b85-9734-ffc92eac4db0]
module.avm-utl-network-ip-addresses.random_uuid.telemetry[0]: Refreshing state... [id=707feac5-fe0d-6d42-ce28-76b8e171335f]
module.storage_account.random_uuid.telemetry[0]: Refreshing state... [id=00797736-9319-5583-9c57-33ffc13554b3]
data.http.ip: Reading...
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.key_vault.random_uuid.telemetry[0]: Refreshing state... [id=677e83a5-7bcf-adc3-235f-e4fbc28cd123]
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group.random_uuid.telemetry[0]: Refreshing state... [id=5f925706-b3ea-01b3-043e-ddef68416e79]
module.log_analytics_workspace.random_uuid.telemetry[0]: Refreshing state... [id=ef08e9c1-7da7-4eb4-e8c8-3a500cd1148c]
module.virtual_network.random_uuid.telemetry[0]: Refreshing state... [id=b88203d8-503e-b8f6-d104-eadbca32da8f]
module.regions.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nat_gateway.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_key_vault.random_uuid.telemetry[0]: Refreshing state... [id=f65e37d3-fb9c-9c75-f1d1-30b2d084ad65]
module.regions.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nat_gateway.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.virtual_network.data.modtm_module_source.telemetry[0]: Reading...
module.network_security_group.data.modtm_module_source.telemetry[0]: Reading...
module.storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_storage_account.random_uuid.telemetry[0]: Refreshing state... [id=da6cca3e-536c-a74c-80f8-68e0eac76400]
module.network_security_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Reading...
module.storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.regions.random_uuid.telemetry[0]: Refreshing state... [id=122024c0-32c4-02d6-29b1-e45451db33de]
module.nat_gateway.random_uuid.telemetry[0]: Refreshing state... [id=0644300d-69a3-aba0-1eb1-adb37059d6ed]
module.network_security_group.random_uuid.telemetry[0]: Refreshing state... [id=b1c235b7-2799-63f0-8a3a-8ef4829406f4]
module.virtual_network.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.data.modtm_module_source.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
data.http.ip: Read complete after 0s [id=https://api.ipify.org/]
module.regions.data.azapi_client_config.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Reading...
module.regions.data.azapi_client_config.current: Reading...
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Read complete after 0s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.regions.data.azapi_client_config.telemetry[0]: Read complete after 0s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.regions.data.azapi_client_config.current: Read complete after 0s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.avm-utl-network-ip-addresses.modtm_telemetry.telemetry[0]: Refreshing state... [id=4185296b-b5a2-4869-8322-e759629b9741]
module.regions.modtm_telemetry.telemetry[0]: Refreshing state... [id=06896a01-d1c5-464f-87f2-78df8eea5cbb]
data.azurerm_client_config.current: Reading...
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.this: Reading...
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.network_security_group.data.azurerm_client_config.telemetry[0]: Reading...
module.key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_subscription.current: Reading...
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev]
module.key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.network_security_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Reading...
module.storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_client_config.telemetry[0]: Reading...
module.network_security_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=270e3746-fe75-40cd-8ce4-39f7fc5e519f]
module.private_dns_zone_storage_account.modtm_telemetry.telemetry[0]: Refreshing state... [id=28b91b2c-f9f1-4745-b784-59554456c7a6]
module.key_vault.modtm_telemetry.telemetry[0]: Refreshing state... [id=d8fb783d-0718-46bf-9e01-38a6d0e09fd1]
module.resource_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_key_vault.modtm_telemetry.telemetry[0]: Refreshing state... [id=3200c1d1-64b0-4470-afc4-43c83b577c82]
module.resource_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=32fc6941-d4e5-4634-a7dd-ad106877e3af]
module.user_assigned_managed_identity.modtm_telemetry.telemetry[0]: Refreshing state... [id=3c0740bb-18c6-4cc2-8d61-04cbf079962f]
module.virtual_network.modtm_telemetry.telemetry[0]: Refreshing state... [id=ffc202ee-1053-4189-ba3f-5f03f3d4f102]
module.log_analytics_workspace.modtm_telemetry.telemetry[0]: Refreshing state... [id=b25ee70c-5547-47fa-a161-6d8168712422]
module.storage_account.modtm_telemetry.telemetry[0]: Refreshing state... [id=efa8ee7b-07a2-4984-9117-7d26574c1635]
module.nat_gateway.modtm_telemetry.telemetry[0]: Refreshing state... [id=2549ffb0-0752-4e59-baad-f3f629df1694]
module.resource_group.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400]
module.private_dns_zone_key_vault.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.nat_gateway.azurerm_nat_gateway.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev]
module.user_assigned_managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-crv-githublab-demo-dev]
module.nat_gateway.azurerm_public_ip.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.log_analytics_workspace.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev]
module.private_dns_zone_storage_account.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
module.network_security_group.azurerm_network_security_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev]
module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev]
module.virtual_network.azapi_resource.vnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev]
module.nat_gateway.azurerm_nat_gateway_public_ip_association.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev|/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.network_security_group.azurerm_network_security_rule.this["no_internet"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev/securityRules/block-internet-traffic]
module.storage_account.azurerm_storage_account.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev]
module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines]
module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet]
module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints]
module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics]
module.virtual_network.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev|sendToLogAnalytics]
module.private_dns_zone_storage_account.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/storage-account]
module.key_vault.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev|sendToLogAnalytics]
module.private_dns_zone_key_vault.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/key-vault]
module.key_vault.azurerm_private_endpoint.this["primary"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-kvcrv-githublabdemodev]
module.storage_account.azurerm_monitor_diagnostic_setting.blob["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/|sendToLogAnalytics]
module.storage_account.azurerm_monitor_diagnostic_setting.storage_account["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev|sendToLogAnalytics]
module.storage_account.azurerm_private_endpoint.this["primary"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-sacrvgithublabdemodev]
module.virtual_machine.random_uuid.telemetry[0]: Refreshing state... [id=506557a6-22fd-73b5-dee4-78445b797de2]
module.virtual_machine.azurerm_network_interface.virtualmachine_network_interfaces["private"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkInterfaces/nic-crv-githublab-demo-dev]
module.virtual_machine.tls_private_key.this[0]: Refreshing state... [id=fbe40774be3a73645abaa757141277793d1e0dfc]
module.virtual_machine.modtm_telemetry.telemetry[0]: Refreshing state... [id=4c025758-d4ad-42a0-8505-207388776fcf]
module.virtual_machine.azurerm_linux_virtual_machine.this[0]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Compute/virtualMachines/vm-crv-githublab-demo-dev]
module.virtual_machine.azurerm_monitor_diagnostic_setting.this_vm_diags["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Compute/virtualMachines/vm-crv-githublab-demo-dev|sendToLogAnalytics]
module.storage_account.azapi_resource.containers["demo"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/containers/demo]
module.storage_account.azurerm_role_assignment.containers["demo-contributor"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/containers/demo/providers/Microsoft.Authorization/roleAssignments/3dd20f65-446a-dade-b7f1-18483aa2cb13]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.key_vault.azurerm_key_vault.this must be replaced
-/+ resource "azurerm_key_vault" "this" {
      ~ access_policy                   = [] -> (known after apply)
      ~ id                              = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev" -> (known after apply)
      ~ name                            = "kvcrv-githublabdemodev" -> "keyvcrv-githublabdemodev" # forces replacement
        tags                            = {
            "env"  = "demo"
            "type" = "avm"
        }
      ~ vault_uri                       = "https://kvcrv-githublabdemodev.vault.azure.net/" -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ contact (known after apply)

      ~ network_acls {
          ~ ip_rules                   = [
              - "52.234.33.0/24",
              + "20.25.192.0/24",
            ]
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "this" {
      ~ id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev|sendToLogAnalytics" -> (known after apply)
        name                           = "sendToLogAnalytics"
      ~ target_resource_id             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

      - enabled_log {
          - category_group = "allLogs" -> null
            # (1 unchanged attribute hidden)

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.key_vault.azurerm_private_endpoint.this["primary"] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-kvcrv-githublabdemodev" -> (known after apply)
      ~ name                          = "pe-kvcrv-githublabdemodev" -> "pe-keyvcrv-githublabdemodev" # forces replacement
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkInterfaces/pe-kvcrv-githublabdemodev.nic.cb43ef28-b417-44d4-b01d-4a27199e6079"
              - name = "pe-kvcrv-githublabdemodev.nic.cb43ef28-b417-44d4-b01d-4a27199e6079"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-kvcrv-githublabdemodev/privateDnsZoneGroups/default/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              - name                = "privatelink.vaultcore.azure.net"
              - private_dns_zone_id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "kvcrv-githublabdemodev.privatelink.vaultcore.azure.net"
                      - ip_addresses = [
                          - "10.0.1.69",
                        ]
                      - name         = "kvcrv-githublabdemodev"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-kvcrv-githublabdemodev/privateDnsZoneGroups/default" -> (known after apply)
            name                 = "default"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                              = "pse-kvcrv-githublabdemodev" -> "pse-keyvcrv-githublabdemodev" # forces replacement
          ~ private_connection_resource_id    = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.1.69" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "this" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics"
      + log_analytics_destination_type = "Dedicated"
        name                           = "sendToLogAnalytics"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.blob["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "blob" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev/blobServices/default/|sendToLogAnalytics"
        name                           = "sendToLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.storage_account["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storage_account" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev|sendToLogAnalytics"
        name                           = "sendToLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.virtual_machine.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.virtual_machine.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/virtual_machine"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.virtual_machine.modtm_telemetry.telemetry[0] will be updated in-place
  ~ resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
        id               = "4c025758-d4ad-42a0-8505-207388776fcf"
      + nonce            = (known after apply)
      ~ tags             = {
          ~ "module_source"   = "registry.terraform.io/Azure/avm-res-compute-virtualmachine/azurerm" -> (known after apply)
          ~ "module_version"  = "0.18.0" -> (known after apply)
            "random_id"       = "506557a6-22fd-73b5-dee4-78445b797de2"
          ~ "subscription_id" = "1ab5dc89-603c-4f45-bdd1-a4231369b400" -> (known after apply)
          ~ "tenant_id"       = "da1aa744-f43d-46fd-8308-5a3f6b99452a" -> (known after apply)
        }
    }

Plan: 3 to add, 4 to change, 3 to destroy.

Changes to Outputs:
  ~ resource_ids   = {
      ~ key_vault                      = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev" -> (known after apply)
        # (10 unchanged attributes hidden)
    }
  ~ resource_names = {
      ~ key_vault_name                      = "kvcrv-githublabdemodev" -> "keyvcrv-githublabdemodev"
        # (10 unchanged attributes hidden)
    }

Warning: Argument is deprecated

  with module.virtual_machine.azurerm_linux_virtual_machine.this[0],
  on .terraform/modules/virtual_machine/main.linux_vm.tf line 41, in resource "azurerm_linux_virtual_machine" "this":
  41:   vm_agent_platform_updates_enabled                      = var.vm_agent_platform_updates_enabled

this property has been deprecated due to a breaking change introduced by the
Service team, which redefined it as a read-only field within the API

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @ch-rob, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*